[
  {
    "collection": "Sahih al-Bukhari",
    "book_number": 1,
    "book_name": "Book of Revelation",
    "chapter_number": 1,
    "chapter_name": "How the Divine Inspiration started",
    "hadith_number": 1,
    "text_arabic": "حَدَّثَنَا الْحُمَيْدِيُّ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الأَنْصَارِيُّ، قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ، أَنَّهُ سَمِعَ عَلْقَمَةَ بْنَ وَقَّاصٍ اللَّيْثِيَّ، يَقُولُ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ عَلَى الْمِنْبَرِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ \" إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى دُنْيَا يُصِيبُهَا أَوْ إِلَى امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ \".",
    "translation_en": "Narrated 'Umar bin Al-Khattab: I heard Allah's Apostle saying, \"The reward of deeds depends upon the intentions and every person will get the reward according to what he has intended. So whoever emigrated for worldly benefits or for a woman to marry, his emigration was for what he emigrated for.\"",
    "chain_of_narrators": "Al-Humaidi 'Abdullah bin Az-Zubair → Sufyan → Yahya bin Sa'id Al-Ansari → Muhammad bin Ibrahim At-Taimi → 'Alqama bin Waqqas Al-Laithi → 'Umar bin Al-Khattab",
    "reference": "1.1.1",
    "tags": ["intentions", "emigration", "rewards", "actions"],
    "grade": "Sahih",
    "narrator": "Umar ibn Al-Khattab",
    "category": "Intentions and Actions"
  },
  {
    "collection": "Sahih al-Bukhari",
    "book_number": 1,
    "book_name": "Book of Revelation",
    "chapter_number": 1,
    "chapter_name": "How the Divine Inspiration started",
    "hadith_number": 2,
    "text_arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ ـ رضى الله عنها ـ أَنَّ الْحَارِثَ بْنَ هِشَامٍ ـ رضى الله عنه ـ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ يَأْتِيكَ الْوَحْىُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم \" أَحْيَانًا يَأْتِينِي مِثْلَ صَلْصَلَةِ الْجَرَسِ، وَهُوَ أَشَدُّهُ عَلَىَّ فَيَفْصِمُ عَنِّي وَقَدْ وَعَيْتُ عَنْهُ مَا قَالَ، وَأَحْيَانًا يَتَمَثَّلُ لِي الْمَلَكُ رَجُلاً فَيُكَلِّمُنِي فَأَعِي مَا يَقُولُ \". قَالَتْ عَائِشَةُ رضى الله عنها وَلَقَدْ رَأَيْتُهُ يَنْزِلُ عَلَيْهِ الْوَحْىُ فِي الْيَوْمِ الشَّدِيدِ الْبَرْدِ فَيَفْصِمُ عَنْهُ وَإِنَّ جَبِينَهُ لَيَتَفَصَّدُ عَرَقًا.",
    "translation_en": "Narrated 'Aisha the mother of the faithful believers: Al-Harith bin Hisham asked Allah's Apostle \"O Allah's Apostle! How is the Divine Inspiration revealed to you?\" Allah's Apostle replied, \"Sometimes it is (revealed) like the ringing of a bell, this form of Inspiration is the hardest of all and then this state passes off after I have grasped what is inspired. Sometimes the Angel comes in the form of a man and talks to me and I grasp whatever he says.\" 'Aisha added: Verily I saw the Prophet being inspired Divinely on a very cold day and noticed the Sweat dropping from his forehead (as the Inspiration was over).",
    "chain_of_narrators": "Abdullah bin Yusuf → Malik → Hisham bin 'Urwa → his father → 'Aisha the mother of the faithful believers",
    "reference": "1.1.2",
    "tags": ["revelation", "inspiration", "angel", "prophecy"],
    "grade": "Sahih",
    "narrator": "Aisha",
    "category": "Revelation and Inspiration"
  },
  {
    "collection": "Sahih al-Bukhari",
    "book_number": 1,
    "book_name": "Book of Revelation",
    "chapter_number": 1,
    "chapter_name": "How the Divine Inspiration started",
    "hadith_number": 3,
    "text_arabic": "حَدَّثَنَا يَحْيَى بْنُ بُكَيْرٍ، قَالَ حَدَّثَنَا اللَّيْثُ، عَنْ عُقَيْلٍ، عَنِ ابْنِ شِهَابٍ، قَالَ أَخْبَرَنِي عُرْوَةُ بْنُ الزُّبَيْرِ، أَنَّ عَائِشَةَ ـ رضى الله عنها ـ أَخْبَرَتْهُ أَنَّهَا قَالَتْ لِلنَّبِيِّ صلى الله عليه وسلم يَا رَسُولَ اللَّهِ هَلْ أَتَى عَلَيْكَ يَوْمٌ كَانَ أَشَدَّ مِنْ يَوْمِ أُحُدٍ قَالَ \" لَقَدْ لَقِيتُ مِنْ قَوْمِكِ مَا لَقِيتُ، وَكَانَ أَشَدُّ مَا لَقِيتُ مِنْهُمْ يَوْمَ الْعَقَبَةِ، إِذْ عَرَضْتُ نَفْسِي عَلَى ابْنِ عَبْدِ يَالِيلَ بْنِ عَبْدِ كُلاَلٍ، فَلَمْ يُجِبْنِي إِلَى مَا أَرَدْتُ، فَانْطَلَقْتُ وَأَنَا مَهْمُومٌ عَلَى وَجْهِي، فَلَمْ أَسْتَفِقْ إِلاَّ وَأَنَا بِقَرْنِ الثَّعَالِبِ، فَرَفَعْتُ رَأْسِي، فَإِذَا أَنَا بِسَحَابَةٍ قَدْ أَظَلَّتْنِي، فَنَظَرْتُ فَإِذَا فِيهَا جِبْرِيلُ فَنَادَانِي فَقَالَ إِنَّ اللَّهَ قَدْ سَمِعَ قَوْلَ قَوْمِكَ لَكَ وَمَا رَدُّوا عَلَيْكَ، وَقَدْ بَعَثَ اللَّهُ إِلَيْكَ مَلَكَ الْجِبَالِ لِتَأْمُرَهُ بِمَا شِئْتَ فِيهِمْ، فَنَادَانِي مَلَكُ الْجِبَالِ فَسَلَّمَ عَلَىَّ ثُمَّ قَالَ يَا مُحَمَّدُ إِنَّ اللَّهَ قَدْ سَمِعَ قَوْلَ قَوْمِكَ لَكَ، وَأَنَا مَلَكُ الْجِبَالِ، وَقَدْ بَعَثَنِي رَبِّي إِلَيْكَ لِتَأْمُرَنِي بِأَمْرِكَ، فَمَا شِئْتَ إِنْ شِئْتَ أَنْ أُطْبِقَ عَلَيْهِمُ الأَخْشَبَيْنِ \". فَقَالَ النَّبِيُّ صلى الله عليه وسلم \" بَلْ أَرْجُو أَنْ يُخْرِجَ اللَّهُ مِنْ أَصْلاَبِهِمْ مَنْ يَعْبُدُ اللَّهَ وَحْدَهُ لاَ يُشْرِكُ بِهِ شَيْئًا \".",
    "translation_en": "Narrated 'Aisha: I asked the Prophet \"Was there a day more difficult for you than the day of the battle of Uhud?\" The Prophet said, \"Yes, I have experienced such a day when I met the people of Quraish (at the battle of Badr). That was the most difficult day. I was offered myself to Ibn 'Abd Yalil bin 'Abd Kulal, but he refused to accept me. So I departed, overwhelmed with excessive sorrow, and proceeded on, and could not relax till I found myself at Qarn ath-Tha'alib where I lifted my head towards the sky to see a cloud shading me unexpectedly. I looked up and saw Gabriel in the midst of the cloud. He called me saying: 'Allah has heard your people's saying to you, and what they have replied back to you, Allah has sent the Angel of the Mountains to you so that you may order him to do whatever you wish to these people.' The Angel of the Mountains called and greeted me, and then said: 'O Muhammad! Order what you wish. If you like, I will let Al-Akhshabain (i.e. two mountains) fall on them.' The Prophet said, 'No but I hope that Allah will let them beget children who will worship Allah Alone, and will worship None besides Him.'\"",
    "chain_of_narrators": "Yahya bin Bukair → Al-Laith → 'Uqail → Ibn Shihab → 'Urwa bin Az-Zubair → 'Aisha",
    "reference": "1.1.3",
    "tags": ["difficulty", "patience", "mercy", "prophecy", "angels"],
    "grade": "Sahih",
    "narrator": "Aisha",
    "category": "Prophetic Challenges"
  },
  {
    "collection": "Sahih al-Bukhari",
    "book_number": 2,
    "book_name": "Book of Belief",
    "chapter_number": 1,
    "chapter_name": "What is said regarding the deeds of the heart",
    "hadith_number": 8,
    "text_arabic": "حَدَّثَنَا أَبُو الْيَمَانِ، قَالَ أَخْبَرَنَا شُعَيْبٌ، عَنِ الزُّهْرِيِّ، قَالَ أَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ أَبَا هُرَيْرَةَ، قَالَ كَانَ النَّبِيُّ صلى الله عليه وسلم بَارِزًا يَوْمًا لِلنَّاسِ، فَأَتَاهُ جِبْرِيلُ فَقَالَ مَا الإِيمَانُ قَالَ \" الإِيمَانُ أَنْ تُؤْمِنَ بِاللَّهِ وَمَلاَئِكَتِهِ وَكُتُبِهِ وَبِلِقَائِهِ وَرُسُلِهِ وَتُؤْمِنَ بِالْبَعْثِ \". قَالَ مَا الإِسْلاَمُ قَالَ \" الإِسْلاَمُ أَنْ تَعْبُدَ اللَّهَ وَلاَ تُشْرِكَ بِهِ شَيْئًا، وَتُقِيمَ الصَّلاَةَ، وَتُؤَدِّيَ الزَّكَاةَ الْمَفْرُوضَةَ، وَتَصُومَ رَمَضَانَ \". قَالَ مَا الإِحْسَانُ قَالَ \" الإِحْسَانُ أَنْ تَعْبُدَ اللَّهَ كَأَنَّكَ تَرَاهُ، فَإِنْ لَمْ تَكُنْ تَرَاهُ فَإِنَّهُ يَرَاكَ \". قَالَ مَتَى السَّاعَةُ قَالَ \" مَا الْمَسْئُولُ عَنْهَا بِأَعْلَمَ مِنَ السَّائِلِ، وَسَأُخْبِرُكَ عَنْ أَشْرَاطِهَا إِذَا وَلَدَتِ الأَمَةُ رَبَّهَا، وَإِذَا تَطَاوَلَ رُعَاةُ الإِبِلِ الْبُهْمُ فِي الْبُنْيَانِ، فِي خَمْسٍ لاَ يَعْلَمُهُنَّ إِلاَّ اللَّهُ \". ثُمَّ تَلاَ النَّبِيُّ صلى الله عليه وسلم {إِنَّ اللَّهَ عِنْدَهُ عِلْمُ السَّاعَةِ} الآيَةَ ثُمَّ أَدْبَرَ فَقَالَ \" رُدُّوهُ \". فَلَمْ يَرَوْا شَيْئًا فَقَالَ \" هَذَا جِبْرِيلُ جَاءَ يُعَلِّمُ النَّاسَ دِينَهُمْ \". قَالَ أَبُو عَبْدِ اللَّهِ جَعَلَ ذَلِكَ كُلَّهُ مِنَ الإِيمَانِ.",
    "translation_en": "Narrated Abu Huraira: One day while the Prophet was sitting in the company of some people, (The angel) Gabriel came and asked, \"What is faith?\" Allah's Apostle replied, 'Faith is to believe in Allah, His angels, (the) meeting with Him, His Apostles, and to believe in Resurrection.\" Then he further asked, \"What is Islam?\" Allah's Apostle replied, \"To worship Allah Alone and none else, to offer prayers perfectly to pay the compulsory charity (Zakat) and to observe fasts during the month of Ramadan.\" Then he further asked, \"What is Ihsan (perfection)?\" Allah's Apostle replied, \"To worship Allah as if you see Him, and if you cannot achieve this state of devotion then you must consider that He is looking at you.\" Then he further asked, \"When will the Hour be established?\" Allah's Apostle replied, \"The answerer has no better knowledge than the questioner. But I will inform you about its portents. When a slave (lady) gives birth to her master, when the shepherds of black camels start boasting and competing with others in the construction of higher buildings. And the Hour is one of five things which nobody knows except Allah.\" The Prophet then recited: \"Verily, with Allah (Alone) is the knowledge of the Hour.\" (31. 34) Then that man (Gabriel) left and the Prophet asked his companions to call him back, but they could not see him. Then the Prophet said, \"That was Gabriel who came to teach the people their religion.\" Abu 'Abdullah said: He (the Prophet) considered all that as a part of faith.",
    "chain_of_narrators": "Abu Al-Yaman → Shu'aib → Az-Zuhri → Abu Salama bin 'Abdur-Rahman → Abu Huraira",
    "reference": "2.1.8",
    "tags": ["faith", "islam", "ihsan", "belief", "worship", "hour"],
    "grade": "Sahih",
    "narrator": "Abu Huraira",
    "category": "Faith and Belief"
  },
  {
    "collection": "Sahih al-Bukhari",
    "book_number": 2,
    "book_name": "Book of Belief",
    "chapter_number": 2,
    "chapter_name": "The religion is easy",
    "hadith_number": 38,
    "text_arabic": "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ \" إِنَّ الدِّينَ يُسْرٌ، وَلَنْ يُشَادَّ الدِّينَ أَحَدٌ إِلاَّ غَلَبَهُ، فَسَدِّدُوا وَقَارِبُوا وَأَبْشِرُوا، وَاسْتَعِينُوا بِالْغَدْوَةِ وَالرَّوْحَةِ وَشَىْءٍ مِنَ الدُّلْجَةِ \".",
    "translation_en": "Narrated Abu Huraira: The Prophet said, \"Religion is very easy and whoever overburdens himself in his religion will not be able to continue in that way. So you should not be extremists, but try to be near to perfection and receive the good tidings that you will be rewarded; and gain strength by worshipping in the mornings, the nights.\"",
    "chain_of_narrators": "Abdullah bin Yusuf → Malik → Abu Az-Zinad → Al-A'raj → Abu Huraira",
    "reference": "2.2.38",
    "tags": ["religion", "ease", "moderation", "worship", "perfection"],
    "grade": "Sahih",
    "narrator": "Abu Huraira",
    "category": "Religious Practice"
  }
] 